#Использование %
print("В команде Мастера кода участников: %s ! " % '6')
print("Итого сегодня в командах участников: %s и %s !" % (6, 6))

#Использование format()
print("Команда Волшебники данных решила задач: {} !".format(42))
print(" Волшебники данных решили задачи за {} секунды!".format(18015.2 ))

#Использование f-строк
score1 = 40
score2 = 42
print (f'Команды решили {score1} и {score2} задач.')

challenge_result = 'Победа команды Волшебники данных!'
print(f'Результат битвы: победа команды {challenge_result}')

tasks_total = 82
time_avg = 45.2
print(f'Сегодня было решено {tasks_total} задач, в среднем по {time_avg} секунды на задачу!)







